app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "m"], ["body", "m"], ["created_at", "2020-03-17 19:22:07.079818"], ["updated_at", "2020-03-17 19:22:07.079818"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params)
    if @book.save
    redirect_to book_path(@book.id)
    flash[:create]='Book was successfully created.'
    else
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "sa"], ["updated_at", "2020-03-19 04:07:59.065568"], ["id", 13]]
---
  def update
    book = Book.find(params[:id])
    book.update(book_params)